import math

pi = 3.14
negative = -3
num = 4
x = 1
y = 2
z = 3

print(round(pi)) # закръгля към най-близкото цяло число
print(math.ceil(pi)) #закръгля към по-високото цяло число
print(math.floor(pi)) #закръгля към по-ниското цяло число
print(abs(negative)) #връща абслоютната стойност на числото
print(pow(pi, 2)) #връща числото повдигнато на дадена степен
print(math.sqrt(num)) #връща корен квадратен от дадено число
print(max(x, y, z)) #връща най-голямото число измежду n на брой числа
print(min(x, y, z)) #връща най-малкото число измежду n на брой числа